/*
 * 题目描述
输入一个十进制数nn，输出该十进制数的补码表示。

输入格式
输入包含一行一个十进制整数。

输出格式
输出该整数的32位补码表示（末尾没有空格）。

输入输出样例
输入 #1复制
2
输出 #1复制
00000000000000000000000000000010
说明/提示
-2147483648<=n<=2147483647−2147483648<=n<=2147483647
 */
#include <stdio.h>
int main(){
    int num;
    scanf("%d",&num);
    int out[32]={0};
    int index=0;
    for(int i=0;i<32;++i){
        if((1<<i)&num){
            out[index++]=1;
        }
        else{
            out[index++]=0;
        }
    }

    for(int i=31;i>=0;--i){
        printf("%d",out[i]);
    }
    return 0;
}

